---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Settings
source: html/61043111-e8cb-b303-86ae-16ec6eed460f.htm
---
# Settings Members

Causes the object to release immediately any resources it may be utilizing.